app/controllers/accounts_controller.rb

  def index
    @accounts = AccountDecorator.decorate_collection Account.all
---
SELECT "accounts".* FROM "accounts"